package day0118;
/**
코딩창에서 다양한 진수의 사용. <br>
8진수 : 0을 붙여 사용.<br>
16진수 : 0x를 붙여 사용.
*/
	
class Radix {
	public static void main(String[] args) {
		//코딩창에서 어떤 진수를 사용하더라도 2진수로 저장하고,  
		int i = 10;//10진수	(Decimal)
		int j = 012;//8진수	(Octal)
		int k = 0xa;//16진수	(Hex)
		//저장된 2진수를 계산하여 10진수로 출력.
		System.out.println("10진수 :"+ i + ", 8진수 : " + j + ", 16진수 : " + k + "합 :"+ ( i + k + k ));
	}
}
/*
10진수 25 -2진수-> 0001 1001
10진수 40 -2진수-> 0010 1000
10진수 150 -2진수-> 1001 0110
10진수 300 -2진수-> 0000 0001 0010 1100

8진수 025 -2진수-> 0001 0101 -10진수-> 21
8진수 0112 -2진수-> 0100 1010 -10진수-> 74
8진수 034 -2진수-> 0001 1100 -10진수-> 28

16진수 0x40 -2진수-> 0100 0000 -10진수-> 64  
16진수 0x35 -2진수-> 0011 0101 -10진수-> 53
16진수 0xbd -2진수-> 1011 1101 -10진수-> 189
*/